#+title: JLS VS Code config

PROPERTY: header-args:json :tangle (print mydir) :mkdirp yes

First thing needed is to have an elisp function to get the proper
location for the destination file.

According to this [[https://stackoverflow.com/questions/65908987/how-to-open-visual-studio-codes-settings-json-file][answer]] on SO:

- Windows `%APPDATA%\Code\User\settings.json`
- macOS `$HOME/Library/Application\ Support/Code/User/settings.json`
- Linux `$HOME/.config/Code/User/settings.json`

#+begin_src emacs-lisp
(setq mydir "try2.json")  
#+end_src

#+RESULTS:
: try2.json

#+begin_src json :tangle (print mydir) :mkdirp yes
{"JLS"}
#+end_src

